cask_args appdir: '/Applications'
tap "aquasecurity/trivy"
tap "azure/kubelogin"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "openssl@3"
brew "ansible"
brew "azcopy"
brew "azure-cli"
brew "colima", restart_service: true
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "git"
brew "helm"
brew "jq"
brew "k6"
brew "kubernetes-cli"
brew "node"
brew "mongosh"
brew "nmap"
brew "openssh"
brew "openvpn"
brew "sqlcmd"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "azure/kubelogin/kubelogin"
brew "hashicorp/tap/terraform"
cask "1password"
cask "azure-data-studio"
cask "caffeine"
cask "dotnet-sdk"
cask "firefox"
cask "font-hack"
cask "font-roboto"
cask "google-chrome"
cask "iterm2"
cask "microsoft-azure-storage-explorer"
cask "microsoft-teams"
cask "onedrive"
cask "openvpn-connect"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "yubico-yubikey-manager"
vscode "bencoleman.armview"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "heaths.vscode-guid"
vscode "humao.rest-client"
vscode "k6.k6"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-apimanagement"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-logicapps"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.mssql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "vsciot-vscode.azure-iot-toolkit"
