tap "aquasecurity/trivy"
tap "azure/functions"
tap "azure/kubelogin"
tap "hashicorp/tap"
brew "openssl@3"
brew "tree"
brew "ansible"
brew "azcopy"
brew "azure-cli"
brew "certbot"
brew "colima", restart_service: :changed
brew "conftest"
brew "coreutils"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "flux"
brew "gh"
brew "git"
brew "glab"
brew "gnu-sed"
brew "helm"
brew "jq"
brew "k6"
brew "k8sgpt"
brew "kubernetes-cli"
brew "node"
brew "mongosh"
brew "nmap"
brew "nvm"
brew "openssh"
brew "openvpn"
brew "pkgconf"
brew "plantuml"
brew "pnpm"
brew "pyenv"
brew "sqlcmd"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "azure/functions/azure-functions-core-tools@4"
brew "azure/kubelogin/kubelogin"
brew "hashicorp/tap/terraform"
cask "1password", args: { appdir: "/Applications" }
cask "caffeine", args: { appdir: "/Applications" }
cask "cloudflare-warp"
cask "dotnet-sdk", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack", args: { appdir: "/Applications" }
cask "font-roboto", args: { appdir: "/Applications" }
cask "gcloud-cli"
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "keka"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer", args: { appdir: "/Applications" }
cask "microsoft-teams", args: { appdir: "/Applications" }
cask "onedrive", args: { appdir: "/Applications" }
cask "openvpn-connect", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code"
cask "whatsapp", args: { appdir: "/Applications" }
cask "windows-app"
cask "yubico-authenticator"
cask "yubico-yubikey-manager", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-apimanagement"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tsandall.opa"
